unload/cf/DataProcessors/кб99_СписаниеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>кб99_СписаниеТоваров</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

unload/cf/Documents/ВСД2_Инвентаризация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ВСД2_Инвентаризация</Name>
			<Comment>api 2.*</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.кб99_ОстаткиПартийВСД</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Владелец_ХозСубъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_ХозСубъект</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Владелец_Площадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_Площадка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Документ-основание</Comment>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаРасхождения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеНесоответствия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Продукция</Name>
					<Comment>Можно фасовку добавить</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_Партия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Продукция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_Продукция</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПродукции</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_ВидПродукции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеПродукции</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Продукция_Элемент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_Продукция_Элемент</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Скоропортящийся</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Некачественный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаИзготовления1</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаИзготовления2</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСрокГодности1</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСрокГодности2</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Производитель_площадка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_Площадка</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Производитель_Страна</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_Страна</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФасовкаФормаУпаковки</Name>
							<Comment>Тип упаковки</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_ФормыУпаковки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФасовкаКоличество</Name>
							<Comment>Количество единиц упаковки</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФасовкаОбъем</Name>
							<Comment>Объем единицы упаковки товара</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФасовкаЕдиницаИзмерения</Name>
							<Comment>Единица измерения объёма единицы упаковки товара</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоДоИзменения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УровниУпаковки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтрокаПродукции</Name>
							<Comment>Связь с таблицей Продукция</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерУровня</Name>
							<Type>
								<v8:Type>cfg:EnumRef.кб99_УровниУпаковки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормаУпаковки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_ФормыУпаковки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Маркировка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерУровня</Name>
							<Type>
								<v8:Type>cfg:EnumRef.кб99_УровниУпаковки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Класс</Name>
							<Type>
								<v8:Type>cfg:EnumRef.кб99_Маркировка</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Маркировка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаПродукции</Name>
							<Comment>Связь с таблицей Продукция</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПартииРезультат</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_Партия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДокументыОснования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументОснования</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

unload/cf/DataProcessors/кб99_СписаниеТоваров/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Перем КэшОтмеченныеСтроки;

#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Период.ДатаНачала = НачалоДня(ТекущаяДатаСеанса());
	Период.ДатаОкончания = КонецДня(ТекущаяДатаСеанса());
		
	Организация = кб99_ВСД_Параметры.ПолучитьОрганизациюПоУмолчанию();
		
	ОбновитьЗаПериодНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПолучитьПредставлениеПериода();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьЗаПериод(Команда)
	
	Если Не ЗначениеЗаполнено(Период) Тогда
		кб99_ВСД.СообщитьПользователю(НСтр("ru = 'Не заполнено поле'"),, "Период", Период);
		Возврат;
	КонецЕсли;
	
	ОбновитьЗаПериодНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура Списать(Команда)
	
	ЗапомнитьОтмеченныеСтроки();
	
	ОформитьДокументСписания();
	ОбновитьЗаПериодНаСервере(Ложь);
	
	ВосстановитьОтмеченныеСтроки();
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметкиСДокументов(Команда)
	
	Для Каждого стр Из Список Цикл
		стр.Отметка = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсеДокументы(Команда)
	УстановитьФлажкиНаВсеДокументы();
КонецПроцедуры

&НаКлиенте
Процедура Отправить(Команда)
	
	СписокДокументовКОтправке = ПодготовитьСписокВСДКОтправке();
	Если СписокДокументовКОтправке.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
		
	Состояние("Выполняем отправку ВСД", , "Ожидайте...", БиблиотекаКартинок.kb99_wrench);
		
	Для Каждого ДокСсылка Из СписокДокументовКОтправке Цикл
		кб99_ВСД.ОтправитьВСДвГИС(ДокСсылка);
	КонецЦикла;
	
	ОбновитьЗаПериодНаСервере(Ложь);
	
	ПоказатьОповещениеПользователя("Выполнено"); 
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьИнтервал(Команда)
	
	Оповещение = Новый ОписаниеОповещения("УстановитьИнтервалЗавершение", ЭтотОбъект);
	РедактироватьПериод(Период, , Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьИнтервалЗавершение(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ПолучитьПредставлениеПериода();
	Период = ВыбранноеЗначение;
	ОбновитьЗаПериодНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьПредставлениеПериода()
	
	НачалоПериода = Период.ДатаНачала;
	КонецПериода = Период.ДатаОкончания;
	ТолькоДаты = Истина;
	
	ТекстПериод = "";
		
	Если ЗначениеЗаполнено(КонецПериода) Тогда 
		Если КонецПериода >= НачалоПериода Тогда
			ТекстПериод = ?(ТолькоДаты, "", " " + НСтр("ru = 'за'")+ " ");
			ТекстПериод = ТекстПериод
				+ ПредставлениеПериода(НачалоДня(НачалоПериода), КонецДня(КонецПериода), "ФП = Истина");
		Иначе
			ТекстПериод = "";
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(НачалоПериода) Тогда

		ТекстПериод = ?(ТолькоДаты, "", " " + НСтр("ru = 'за'")+ " ")
			+ ПредставлениеПериода(НачалоДня(НачалоПериода), КонецДня(Дата(3999, 11, 11)), "ФП = Истина");
		ТекстПериод = СтрЗаменить(ТекстПериод, Сред(ТекстПериод, СтрНайти(ТекстПериод, " - ")), " - ...");

	КонецЕсли;
	
	ТекстПериод = "Период: " + ТекстПериод;
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьПериод(Объект, ПараметрыПериода = Неопределено, ОповещениеПослеВыбора = Неопределено) Экспорт
	
	Если ПараметрыПериода = Неопределено Тогда
		ПараметрыПериода = Новый Структура("ДатаНачала, ДатаОкончания", "ДатаНачала", "ДатаОкончания");
	КонецЕсли;
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	Если ПараметрыПериода.Свойство("ДатаНачала") Тогда
		Диалог.Период.ДатаНачала = Объект[ПараметрыПериода.ДатаНачала];
	КонецЕсли; 
	Если ПараметрыПериода.Свойство("ДатаОкончания") Тогда
		Диалог.Период.ДатаОкончания = Объект[ПараметрыПериода.ДатаОкончания];
	КонецЕсли; 
	Если ПараметрыПериода.Свойство("Вариант") Тогда
		Диалог.Период.Вариант = ПараметрыПериода.Вариант;
	КонецЕсли; 
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Объект",           Объект);
	ДополнительныеПараметры.Вставить("ПараметрыПериода", ПараметрыПериода);
	Если ОповещениеПослеВыбора <> Неопределено Тогда
		ДополнительныеПараметры.Вставить("ОповещениеПослеВыбора", ОповещениеПослеВыбора);
	КонецЕсли; 
	
	Оповещение = Новый ОписаниеОповещения(
		"РедактироватьПериодЗавершение", 
		ЭтотОбъект, 
		ДополнительныеПараметры);
	
	Диалог.Показать(Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура РедактироватьПериодЗавершение(Период, ДополнительныеПараметры) Экспорт 

	ПараметрыПериода = ДополнительныеПараметры.ПараметрыПериода;
	Объект_           = ДополнительныеПараметры.Объект;
	Если Период <> Неопределено Тогда
		Если ПараметрыПериода.Свойство("ДатаНачала") Тогда
			Объект_[ПараметрыПериода.ДатаНачала]= Период.ДатаНачала;
		КонецЕсли; 
		Если ПараметрыПериода.Свойство("ДатаОкончания") Тогда
			Объект_[ПараметрыПериода.ДатаОкончания]= Период.ДатаОкончания;
		КонецЕсли; 
		Если ПараметрыПериода.Свойство("Вариант") Тогда
			Объект_[ПараметрыПериода.Вариант]= Период.Вариант;
		КонецЕсли;
	КонецЕсли;
	
	Если ДополнительныеПараметры.Свойство("ОповещениеПослеВыбора") Тогда
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОповещениеПослеВыбора, Период);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапомнитьОтмеченныеСтроки()
	
	КэшОтмеченныеСтроки = Новый Массив;
	
	Для Каждого Стр Из Список Цикл
		
		Если Стр.Отметка Тогда	
			КэшОтмеченныеСтроки.Добавить(Стр.ДокументРеализации);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьОтмеченныеСтроки()
	
	Для Каждого Док Из КэшОтмеченныеСтроки Цикл
		
		ОтмеченныеСтроки = Список.НайтиСтроки(Новый Структура("ДокументРеализации", Док));
		Для Каждого Стр Из ОтмеченныеСтроки Цикл
			Стр.Отметка = Истина;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьЗаПериодНаСервере(УстановитьФлажки = Ложь)
	
	ЗаполнитьСтрокиТЧДокументамиРеализаций();
	Если УстановитьФлажки Тогда
		УстановитьФлажкиНаВсеДокументы();
	КонецЕсли;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтрокиТЧДокументамиРеализаций();
	
	Список.Очистить();
	
	Запрос = Новый Запрос;
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка КАК ДокументРеализации,
		|	РеализацияТоваровУслуг.Контрагент
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И РеализацияТоваровУслуг.Проведен
		|	%ВСД_не_Выписываем%
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДокументРеализации
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ВСД2_ИнвентаризацияДокументыОснования.ДокументОснования.Ссылка КАК Документ.РеализацияТоваровУслуг).Ссылка КАК ДокументОснования,
		|	ВСД2_ИнвентаризацияДокументыОснования.Ссылка КАК ДокументИнвентаризации
		|ПОМЕСТИТЬ ВТ2
		|ИЗ
		|	Документ.ВСД2_Инвентаризация.ДокументыОснования КАК ВСД2_ИнвентаризацияДокументыОснования
		|ГДЕ
		|	НЕ ВСД2_ИнвентаризацияДокументыОснования.Ссылка.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.ДокументРеализации КАК ДокументРеализации,
		|	ВТ2.ДокументИнвентаризации КАК ДокументИнвентаризации,
		|	кб99_ЗапросыСрезПоследних.СтатусЗапросаПеречисление КАК СтатусЗапроса,
		|	ВТ.Контрагент
		|ИЗ
		|	ВТ КАК ВТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ2 КАК ВТ2
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.кб99_Запросы.СрезПоследних(
		|					,
		|					Объект В
		|						(ВЫБРАТЬ
		|							ВТ2.ДокументИнвентаризации КАК ДокументИнвентаризации
		|						ИЗ
		|							ВТ2 КАК ВТ2)) КАК кб99_ЗапросыСрезПоследних
		|			ПО ВТ2.ДокументИнвентаризации = кб99_ЗапросыСрезПоследних.Объект
		|		ПО ВТ.ДокументРеализации = ВТ2.ДокументОснования";
		
	Запрос.УстановитьПараметр("ДатаНачала",		 Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания",	 Период.ДатаОкончания);
	
	Если кб99_ВСД_Утилиты.ЕстьРеквизитИлиСвойствоОбъекта(Метаданные.Справочники.Партнеры.Реквизиты, "ВСД_не_Выписываем") Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ВСД_не_Выписываем%", "И РеализацияТоваровУслуг.Партнер.ВСД_не_Выписываем");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ВСД_не_Выписываем%", "");
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Список.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

//&НаСервере
//Процедура ЗаполнитьТаблицуПартийНаСервере_()
//	
//	ПараметрыОрганизации = кб99_ВСД.ЗагрузитьПараметры(Организация);
//	
//	// Подготовка требуемых партий из отгрузок
//	ТаблицаОтгрузок = Список.Выгрузить();
//	РезультатПодготовки = ПодготовитьТребуемыеПартии(
//		ТаблицаОтгрузок,
//		ПараметрыОрганизации
//	);
//	
//	ТребуемыеПартии = РезультатПодготовки.ТаблицаПартий;
//	ПолеСортировкиПокупателя = РезультатПодготовки.ПолеСортировкиПокупателя;
//	ЗнакСортировкиПокупателя = РезультатПодготовки.ЗнакСортировкиПокупателя;
//	
//	Если ТребуемыеПартии.Количество() = 0 Тогда
//		кб99_ВСД.СообщитьИнфо("Нет документов к созданию списания ->");
//		Возврат;
//	КонецЕсли;
//	
//	Отправитель_ХозСубъект = ПараметрыОрганизации.Отправитель_ХозСубъект;
//	Отправитель_Площадка = ПараметрыОрганизации.Отправитель_Площадка;
//	
//	// Поиск с использованием запроса
//	//Отправитель_ХозСубъект = ПолучитьХозСубъекта();
//	//Отправитель_Площадка = ПолучитьПлощадку(Отправитель_ХозСубъект);
//	
//	// Получение актуальных партий
//	АктуальныеПартии = кб99_ВСД.ПолучитьАктуальныеПартии(
//		ПараметрыОрганизации,
//		ТребуемыеПартии.ВыгрузитьКолонку("ВСД_Продукция_Элемент"),
//		Отправитель_Площадка,
//		Отправитель_ХозСубъект,
//		ПолеСортировкиПокупателя,
//		ЗнакСортировкиПокупателя,
//		ТребуемыеПартии.ВыгрузитьКолонку("Номенклатура")
//	);
//	
//	Если НЕ (ТипЗнч(АктуальныеПартии) = Тип("ТаблицаЗначений")) И НЕ Объект.ПарамЗаполнятьТранзакциюПриОтсутствииПартий Тогда
//		кб99_ВСД.СообщитьИнфо("Нет актуальных партий для создания Документов ");
//		Возврат;
//	КонецЕсли;
//	
//	// Уменьшаем актуальные партии на уже распределенные
//	//УменьшитьАктуальныеПартииНаРаспределенные(АктуальныеПартии);
//	
//	// Распределение партий
//	РаспределенныеПартии = кб99_ВСД_УправлениеФормой.РаспределитьПартииПоОстаткам(
//		ТребуемыеПартии,
//		АктуальныеПартии,
//		ПараметрыОрганизации
//	);
//	
//	РаспределенныеПартии.Свернуть(
//		"ВидПродукции,
//		|Документ,
//		//|ИдентификаторСтроки,
//		|Номенклатура,
//		|Партия,
//		|ПолеСортировки,
//		|Продукция_Элемент,
//		|Остаток,
//		|ТермическиеУсловияПеревозки",
//		"Количество,
//		//|Остаток,
//		|КоличествоСписания");
//	
//	СоздатьДокументИнвентаризации(РаспределенныеПартии, Организация, Отправитель_ХозСубъект, Отправитель_Площадка);
//	
//КонецПроцедуры

&НаСервере
Процедура ОформитьДокументСписания()
	
	ПараметрыОрганизации = кб99_ВСД.ЗагрузитьПараметры( Организация );
	
	РаспределенныеПартии = ПодготовитьТаблицуПартийКСписанию(ПараметрыОрганизации);
	
	ДокВСД = Документы.ВСД2_Инвентаризация.СоздатьДокумент();
	
	ДокВСД.Дата = ТекущаяДатаСеанса(); 
	ДокВСД.Организация = Организация;
	ДокВСД.Владелец_ХозСубъект = ПараметрыОрганизации.Отправитель_ХозСубъект;
	ДокВСД.Владелец_площадка = ПараметрыОрганизации.Отправитель_Площадка;
	ДокВСД.ПричинаРасхождения = "Продажа конечному покупателю";
	
	ПартииКИнвентаризации = РаспределенныеПартии.Скопировать();
	ПартииКИнвентаризации.Свернуть("Номенклатура, Партия, Продукция_Элемент, Остаток, Количество", "КоличествоСписания");
	ДокументыОснование = кб99_ВСД_Утилиты.СвернутьМассив(РаспределенныеПартии.ВыгрузитьКолонку("Документ"));
	
	Для Каждого СтрПартии Из ПартииКИнвентаризации Цикл
		
		Если Не ЗначениеЗаполнено(СтрПартии.Продукция_Элемент) Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СтрПартии.Партия) Тогда
			кб99_ВСД.СообщитьИнфо("Недостаточно продукции ["+СтрПартии.Продукция_Элемент+"] для списания. Не хватило: " +
				СтрПартии.КоличествоСписания);
			Продолжить;
		КонецЕсли;
		
		Если СтрПартии.Остаток >= СтрПартии.КоличествоСписания Тогда
			Количество = СтрПартии.Остаток - СтрПартии.КоличествоСписания;
		Иначе
			Количество = 0;
		КонецЕсли;
				
		НоваяСтрока = ДокВСД.Продукция.Добавить();
		НоваяСтрока.КлючСтроки = Новый УникальныйИдентификатор();
		НоваяСтрока.КоличествоДоИзменения	= СтрПартии.Остаток;
		НоваяСтрока.Количество 				= Количество;
		НоваяСтрока.Партия 					= СтрПартии.Партия;
		НоваяСтрока.Продукция_Элемент 		= СтрПартии.Партия.Продукция_Элемент;
		НоваяСтрока.Продукция 				= НоваяСтрока.Партия.Продукция;
		НоваяСтрока.ВидПродукции 			= НоваяСтрока.Партия.ВидПродукции;
		НоваяСтрока.ЕдиницаИзмерения 		= НоваяСтрока.Партия.ЕдиницаИзмерения;
		НоваяСтрока.НаименованиеПродукции	= НоваяСтрока.Продукция_Элемент.Наименование;
		
		Если ЗначениеЗаполнено(НоваяСтрока.Партия.ДатаИзготовления1) Тогда
			НоваяСтрока.ДатаИзготовления1 = СтрокаВДату(НоваяСтрока.Партия.ДатаИзготовления1);
		КонецЕсли;
		Если ЗначениеЗаполнено(НоваяСтрока.Партия.ДатаИзготовления2) Тогда
			НоваяСтрока.ДатаИзготовления2 = СтрокаВДату(НоваяСтрока.Партия.ДатаИзготовления2);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НоваяСтрока.Партия.ДатаСрокГодности1) Тогда
			НоваяСтрока.ДатаСрокГодности1 = СтрокаВДату(НоваяСтрока.Партия.ДатаСрокГодности1);
		КонецЕсли;
		Если ЗначениеЗаполнено(НоваяСтрока.Партия.ДатаСрокГодности2) Тогда
			НоваяСтрока.ДатаСрокГодности2 = СтрокаВДату(НоваяСтрока.Партия.ДатаСрокГодности2);
		КонецЕсли;
		
		НоваяСтрока.Производитель_площадка = НоваяСтрока.Партия.Производитель_Площадка;
		НоваяСтрока.Производитель_Страна = ?(ЗначениеЗаполнено(НоваяСтрока.Производитель_площадка.Страна), 
			НоваяСтрока.Производитель_площадка.Страна,
			ПараметрыОрганизации["Страна"]);
	КонецЦикла;
	
	Если Не ДокВСД.Продукция.Количество() ТОгда
		кб99_ВСД.СообщитьИнфо("Отсутстсвуют партии к списанию.");
		Возврат;	
	КонецЕсли;
	
	Для каждого Документ Из ДокументыОснование Цикл
	
		нСтр = ДокВСД.ДокументыОснования.Добавить();
		нСтр.ДокументОснования = Документ;
		
	КонецЦикла;
	
	ДокВСД.Записать();
	
КонецПроцедуры

//&НаСервере
//Функция ПодготовитьТребуемыеПартии(ТаблицаОтгрузок, ПараметрыОрганизации)
//	
//	ВремПартии = Новый ТаблицаЗначений;
//	ВремПартии.Колонки.Добавить("Номенклатура");
//	ВремПартии.Колонки.Добавить("ВСД_Продукция_Элемент");
//	ВремПартии.Колонки.Добавить("КоличествоСписания");
//	ВремПартии.Колонки.Добавить("СерияНоменклатуры");
//	ВремПартии.Колонки.Добавить("Документ");
//	ВремПартии.Колонки.Добавить("ТермУсловияПеревозки");
//	ВремПартии.Колонки.Добавить("Контрагент");
//	ВремПартии.Колонки.Добавить("ВидПродукции");
//	ВремПартии.Колонки.Добавить("ИдентификаторСтроки");
//	
//	ИтоговаяТаблицаТоваров = Новый ТаблицаЗначений;
//	ИтоговаяТаблицаТоваров.Колонки.Добавить("ВидПродукции");
//	ИтоговаяТаблицаТоваров.Колонки.Добавить("Документ");
//	ИтоговаяТаблицаТоваров.Колонки.Добавить("ИдентификаторСтроки");
//	ИтоговаяТаблицаТоваров.Колонки.Добавить("Количество");
//	ИтоговаяТаблицаТоваров.Колонки.Добавить("Контрагент");
//	ИтоговаяТаблицаТоваров.Колонки.Добавить("Коэффициент");
//	ИтоговаяТаблицаТоваров.Колонки.Добавить("Номенклатура");
//	ИтоговаяТаблицаТоваров.Колонки.Добавить("Продукция_Элемент");
//	ИтоговаяТаблицаТоваров.Колонки.Добавить("РезультатыИсследований");
//	ИтоговаяТаблицаТоваров.Колонки.Добавить("СерияНоменклатуры");
//	ИтоговаяТаблицаТоваров.Колонки.Добавить("ТермУсловияПеревозки");
//	ИтоговаяТаблицаТоваров.Колонки.Добавить("Упаковки");
//	
//	ПолеСортировкиПокупателя = Неопределено;
//	ЗнакСортировкиПокупателя = Неопределено;
//	
//	Для Каждого СтрОтгрузки Из ТаблицаОтгрузок Цикл
//		
//		Если НЕ СтрОтгрузки.Отметка Тогда
//			Продолжить;
//		КонецЕсли;
//		
//		// Выгружаем товары из документа
//		ТаблицаТоваров = кб99_ВСД_ЗаполнениеДокументов.ВыгрузитьТЧ(СтрОтгрузки.ДокументРеализации, ПараметрыОрганизации);
//		Если ТаблицаТоваров.Колонки.Найти("Документ") = Неопределено Тогда
//			ТаблицаТоваров.Колонки.Добавить("Документ");
//		КонецЕсли;
//		
//		Для Каждого Стр Из ТаблицаТоваров Цикл
//			Стр.Документ = СтрОтгрузки.ДокументРеализации;
//		КонецЦикла;
//		
//		ДополнитьТаблицу(ТаблицаТоваров, ИтоговаяТаблицаТоваров);
//		
//	КонецЦикла;
//	
//	ИтоговаяТаблицаТоваров.Свернуть(
//		"ВидПродукции,
//		|ИдентификаторСтроки,
//		|Контрагент,
//		|Номенклатура,
//		|Документ,
//		|Продукция_Элемент,
//		|РезультатыИсследований,
//		|СерияНоменклатуры,
//		|ТермУсловияПеревозки,
//		|Упаковки",
//		"Количество,
//		|Коэффициент");
//	
//	Для Каждого СтрокаТоваров Из ИтоговаяТаблицаТоваров Цикл
//		СтрокаПартий = ВремПартии.Добавить();
//		СтрокаПартий.Номенклатура = СтрокаТоваров.Номенклатура;
//		СтрокаПартий.ВСД_Продукция_Элемент = СтрокаТоваров.Продукция_Элемент;
//		СтрокаПартий.КоличествоСписания = СтрокаТоваров.Количество;
//		СтрокаПартий.СерияНоменклатуры = СтрокаТоваров.СерияНоменклатуры;
//		СтрокаПартий.Документ = СтрокаТоваров.Документ;
//		//СтрокаПартий.Контрагент = СтрОтгрузки.Контрагент;
//		СтрокаПартий.ТермУсловияПеревозки = СтрокаТоваров.ТермУсловияПеревозки;
//		СтрокаПартий.ВидПродукции = СтрокаТоваров.ВидПродукции;
//		СтрокаПартий.ИдентификаторСтроки = СтрокаТоваров.ИдентификаторСтроки;
//	КонецЦикла;
//	
//	ВремПартии.Свернуть(
//		"ВСД_Продукция_Элемент,
//		|СерияНоменклатуры,
//		|Номенклатура,
//		|Документ,
//		|ТермУсловияПеревозки,
//		|Контрагент,
//		|ВидПродукции,
//		|ИдентификаторСтроки",
//		"КоличествоСписания");
//	ВремПартии.Сортировать("ВСД_Продукция_Элемент");
//	
//	Результат = Новый Структура;
//	Результат.Вставить("ТаблицаПартий", ВремПартии);
//	Результат.Вставить("ПолеСортировкиПокупателя", ПолеСортировкиПокупателя);
//	Результат.Вставить("ЗнакСортировкиПокупателя", ЗнакСортировкиПокупателя);
//	
//	Возврат Результат;
//	
//КонецФункции

//&НаСервере
//Функция ПолучитьХозСубъекта()
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	ВСД_ХозСубъект.Ссылка
//		|ИЗ
//		|	Справочник.ВСД_ХозСубъект КАК ВСД_ХозСубъект
//		|ГДЕ
//		|	ВСД_ХозСубъект.GUID = ""b26e9fef-560b-452f-8b53-d3d6b0322349""";
//	
//	Выборка = Запрос.Выполнить().Выбрать();
//	Если Выборка.Следующий() Тогда
//		Возврат Выборка.Ссылка;
//	КонецЕсли;
//	
//КонецФункции

//&НаСервере
//Функция ПолучитьПлощадку(ХозСубъект)
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	ВСД_Площадка.Ссылка
//		|ИЗ
//		|	Справочник.ВСД_Площадка КАК ВСД_Площадка
//		|ГДЕ
//		|	ВСД_Площадка.ХозСубъект = &ХозСубъект";
//	Запрос.УстановитьПараметр("ХозСубъект", ХозСубъект);
//	
//	Выборка = Запрос.Выполнить().Выбрать();
//	Если Выборка.Следующий() Тогда
//		Возврат Выборка.Ссылка;
//	КонецЕсли;
//	
//КонецФункции

//&НаСервере
//Процедура СоздатьДокументИнвентаризации(РаспределенныеПартии, Организация, Отправитель_ХозСубъект, Отправитель_Площадка)
//	
//	Док = Документы.ВСД2_Инвентаризация.СоздатьДокумент();
//	
//	ПараметрыОрганизации = кб99_ВСД.ЗагрузитьПараметры(Организация);
//	
//	Док.Организация = Организация;
//	
//	Док.Владелец_ХозСубъект = Отправитель_ХозСубъект;
//	Док.Владелец_Площадка   = Отправитель_Площадка;
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	ЕСТЬNULL(РаспределенныеПартии.ВидПродукции, ЗНАЧЕНИЕ(Справочник.ВСД_ВидПродукции.ПустаяСсылка)) КАК ВидПродукции,
//		|	ЕСТЬNULL(РаспределенныеПартии.Документ, ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)) КАК Документ,
//		|	ЕСТЬNULL(РаспределенныеПартии.Количество, 0) КАК Количество,
//		|	ЕСТЬNULL(РаспределенныеПартии.КоличествоСписания, 0) КАК КоличествоСписания,
//		|	ЕСТЬNULL(РаспределенныеПартии.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура,
//		|	ЕСТЬNULL(РаспределенныеПартии.Остаток, 0) КАК Остаток,
//		|	ЕСТЬNULL(РаспределенныеПартии.Партия, ЗНАЧЕНИЕ(Справочник.ВСД_Партия.ПустаяСсылка)) КАК Партия,
//		|	ЕСТЬNULL(РаспределенныеПартии.Продукция_Элемент, ЗНАЧЕНИЕ(Справочник.ВСД_Продукция_Элемент.ПустаяСсылка)) КАК Продукция_Элемент,
//		|	ЕСТЬNULL(РаспределенныеПартии.ТермическиеУсловияПеревозки, ЗНАЧЕНИЕ(Перечисление.кб99_ТермическиеУсловияПеревозки.ПустаяСсылка)) КАК ТермическиеУсловияПеревозки
//		|ПОМЕСТИТЬ втПартии
//		|ИЗ
//		|	&РаспределенныеПартии КАК РаспределенныеПартии
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	втПартии.ВидПродукции КАК ВидПродукции,
//		|	втПартии.Документ КАК Документ,
//		|	втПартии.Количество КАК Количество,
//		|	втПартии.КоличествоСписания КАК КоличествоСписания,
//		|	втПартии.Номенклатура КАК Номенклатура,
//		|	втПартии.Остаток КАК Остаток,
//		|	втПартии.Партия КАК Партия,
//		|	втПартии.Продукция_Элемент КАК Продукция_Элемент,
//		|	втПартии.ТермическиеУсловияПеревозки КАК ТермическиеУсловияПеревозки
//		|ИЗ
//		|	втПартии КАК втПартии
//		|ИТОГИ
//		|	МАКСИМУМ(Остаток)
//		|ПО
//		|	Партия";
//	Запрос.УстановитьПараметр("РаспределенныеПартии", РаспределенныеПартии);
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
//	Пока Выборка.Следующий() Цикл
//		
//		КоличествоОстаток = Выборка.Остаток;
//		
//		НоваяСтрока = Док.Продукция.Добавить();
//		
//		ВыборкаДетальныеЗаписи = Выборка.Выбрать();
//		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
//			
//			Если ВыборкаДетальныеЗаписи.Партия = Неопределено Тогда
//				
//				НоваяСтрока.Продукция_Элемент = ВыборкаДетальныеЗаписи.Продукция_Элемент;
//				кб99_ВСД.СообщитьПользователю(СтрШаблон(НСтр("ru = 'На остатках партии продукции элемента [%1] не хватает количество списания [%2] для документа [%3]'"),
//					ВыборкаДетальныеЗаписи.Продукция_Элемент, ВыборкаДетальныеЗаписи.КоличествоСписания, ВыборкаДетальныеЗаписи.Документ));
//					
//				Если КоличествоОстаток = Неопределено Тогда
//					КоличествоОстаток = 0;
//				КонецЕсли;
//				ДокументыСНехватающимКоличеством.Добавить(ВыборкаДетальныеЗаписи.Документ);
//				
//				//ОтборСтрок = Новый Структура;
//				//ОтборСтрок.Вставить("ДокументРеализации", ВыборкаДетальныеЗаписи.Документ);
//				//
//				//СписокТЗ = РеквизитФормыВЗначение("Список");
//				//
//				//НайденныеСтрокиВТЧСписок = СписокТЗ.НайтиСтроки(ОтборСтрок);
//				//
//				//Если НайденныеСтрокиВТЧСписок.Количество() = 0 Тогда
//				//	Продолжить;
//				//КонецЕсли;
//				//
//				//НайденнаяСтрока = НайденныеСтрокиВТЧСписок[0];
//				//Если ЗначениеЗаполнено(НайденнаяСтрока) Тогда
//				//	НайденнаяСтрока.УстановитьЦвет = Истина;
//				//КонецЕсли;
//				//
//				//ЗначениеВРеквизитФормы(СписокТЗ, "Список");
//				
//				//Для Каждого стр Из Список Цикл
//				//	Если (стр.ДокументРеализации = ВыборкаДетальныеЗаписи.Документ) И стр.УстановитьЦвет = Ложь Тогда
//				//		стр.УстановитьЦвет = Истина;
//				//		Прервать;
//				//	КонецЕсли;
//				//КонецЦикла;
//				
//			КонецЕсли;
//			
//			Разница = КоличествоОстаток - ВыборкаДетальныеЗаписи.КоличествоСписания;
//			
//			НоваяСтрока.КлючСтроки = Новый УникальныйИдентификатор();
//			
//			НоваяСтрока.Продукция_Элемент = ВыборкаДетальныеЗаписи.Продукция_Элемент;
//			НоваяСтрока.Количество        = Разница;
//			
//			Если ВыборкаДетальныеЗаписи.Партия <> Неопределено Тогда
//				
//				НоваяСтрока.Партия           = ВыборкаДетальныеЗаписи.Партия;
//				НоваяСтрока.ЕдиницаИзмерения = ВыборкаДетальныеЗаписи.Партия.ЕдиницаИзмерения;
//				
//				ДатаИзготовления1 = СтрокаВДату(ВыборкаДетальныеЗаписи.Партия.ДатаИзготовления1);
//				ДатаСрокГодности1 = СтрокаВДату(ВыборкаДетальныеЗаписи.Партия.ДатаСрокГодности1);
//				
//				НоваяСтрока.ДатаИзготовления1 = ДатаИзготовления1;
//				НоваяСтрока.ДатаСрокГодности1 = ДатаСрокГодности1;
//				
//			КонецЕсли;
//			
//			НоваяСтрока.НаименованиеПродукции = ВыборкаДетальныеЗаписи.Продукция_Элемент.Наименование;
//			
//			НоваяСтрока.Производитель_площадка = ВыборкаДетальныеЗаписи.Продукция_Элемент.Площадка;
//			НоваяСтрока.Производитель_Страна   = ?(ЗначениеЗаполнено(НоваяСтрока.Производитель_площадка.Страна),
//				НоваяСтрока.Производитель_площадка.Страна,
//				ПараметрыОрганизации["Страна"]);
//			
//			НоваяСтрока.Продукция    = ВыборкаДетальныеЗаписи.Продукция_Элемент.Продукция;
//			НоваяСтрока.ВидПродукции = ВыборкаДетальныеЗаписи.Продукция_Элемент.ВидПродукции;
//			
//			КоличествоОстаток = Разница;
//			
//			ОтборСтрок = Новый Структура;
//			ОтборСтрок.Вставить("ДокументОснования", ВыборкаДетальныеЗаписи.Документ);
//			
//			НайденныеСтрокиВТЧДокументыОснования = Док.ДокументыОснования.НайтиСтроки(ОтборСтрок);
//				
//			Если НайденныеСтрокиВТЧДокументыОснования.Количество() > 0 Тогда
//				Продолжить;
//			КонецЕсли;
//			
//			НоваяСтрокаТЧ = Док.ДокументыОснования.Добавить();
//			НоваяСтрокаТЧ.ДокументОснования = ВыборкаДетальныеЗаписи.Документ;
//			
//		КонецЦикла;
//		
//	КонецЦикла;
//	
//	Док.Дата = ТекущаяДатаСеанса();
//	
//	Попытка
//		Док.Записать();
//	Исключение
//		кб99_ВСД.СообщитьИнфо(ОписаниеОшибки());
//	КонецПопытки;
//	
//	Элементы.Список.Обновить();
//	
//КонецПроцедуры

&НаСервере
Функция СтрокаВДату(СтрокаДаты)
	
	Попытка
		// Разбиваем строку на компоненты по разделителю "-"
		МассивКомпонентов = СтрРазделить(СтрокаДаты, "-", Ложь);
		
		// Проверяем количество компонентов
		Если МассивКомпонентов.Количество() <> 3 Тогда
			ВызватьИсключение "Некорректный формат даты. Требуется формат ГГГГ-ММ-ДД";
		КонецЕсли;
		
		// Преобразуем компоненты в числа
		Год   = Число(МассивКомпонентов[0]);
		Месяц = Число(МассивКомпонентов[1]);
		День  = Число(МассивКомпонентов[2]);
		
		// Создаем дату (время устанавливается в 00:00:00)
		Возврат Дата(Год, Месяц, День);
		
	Исключение
		// Формируем детальное сообщение об ошибке
		ОписаниеОшибки = СтрШаблон("Ошибка преобразования строки '%1' в дату.", СтрокаДаты) + Символы.ПС + ОписаниеОшибки();
		кб99_ВСД.СообщитьИнфо(ОписаниеОшибки);
	КонецПопытки;
	
КонецФункции

//&НаКлиенте
//Процедура ПериодПриИзменении(Элемент)
//	ОбновитьЗаПериодНаСервере();
//КонецПроцедуры

&НаСервере
Процедура УстановитьФлажкиНаВсеДокументы()
	
	Для Каждого стр Из Список Цикл
		//Если Не ЗначениеЗаполнено(стр.ДокументИнвентаризации) Тогда
			стр.Отметка = Истина;
		//КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПодготовитьСписокВСДКОтправке()
	
	СписокДокументовКОтправке = Новый Массив;
	
	Для Каждого СтрТч Из Список Цикл
		
		ВСДДокумент = СтрТч.ДокументИнвентаризации;
		
		// Пропускаем незаполненные и неотмеченные строки
		Если НЕ ЗначениеЗаполнено(ВСДДокумент) ИЛИ НЕ СтрТч.Отметка Тогда
			Продолжить;
		КонецЕсли;
			
		// Пропускаем документы с заявками, если не требуется их повторная отправка
		ПоследнийЗапрос = кб99_ВСД_Утилиты.НайтиПоследнийЗапрос(ВСДДокумент);
		Если ПоследнийЗапрос.СтатусЗапросаПеречисление = Перечисления.кб99_СтатусЗапроса.COMPLETED Тогда
			кб99_ВСД.СообщитьИнфо("Документ: " + ВСДДокумент + " уже обработан. Пропускаем.");
			Продолжить;
		КонецЕсли;
		
		СписокДокументовКОтправке.Добавить(ВСДДокумент);
		
	КонецЦикла;
	
	СписокДокументовКОтправке = кб99_ВСД_Утилиты.СвернутьМассив(СписокДокументовКОтправке);
	
	Возврат СписокДокументовКОтправке;
	
КонецФункции

&НаСервере
Функция ПодготовитьТаблицуПартийКСписанию(ПараметрыОрганизации)
		
	ВремПартии = Новый ТаблицаЗначений;   
	ВремПартии.Колонки.Добавить("Номенклатура");
	ВремПартии.Колонки.Добавить("ВСД_Продукция_Элемент");
	ВремПартии.Колонки.Добавить("КоличествоСписания");
	ВремПартии.Колонки.Добавить("СерияНоменклатуры");
	ВремПартии.Колонки.Добавить("Документ");
	ВремПартии.Колонки.Добавить("ТермУсловияПеревозки");
	ВремПартии.Колонки.Добавить("Контрагент");
	ВремПартии.Колонки.Добавить("ВидПродукции");
	
	РаспределенныеПартии = Новый ТаблицаЗначений; // итоговая ТЗ
	РаспределенныеПартии.Колонки.Добавить("Номенклатура");
	РаспределенныеПартии.Колонки.Добавить("Продукция_Элемент");
	РаспределенныеПартии.Колонки.Добавить("Партия");
	РаспределенныеПартии.Колонки.Добавить("Остаток");
	РаспределенныеПартии.Колонки.Добавить("Количество");
	РаспределенныеПартии.Колонки.Добавить("КоличествоСписания");
	РаспределенныеПартии.Колонки.Добавить("ПолеСортировки");
	РаспределенныеПартии.Колонки.Добавить("Документ");
	РаспределенныеПартии.Колонки.Добавить("ТермическиеУсловияПеревозки");
	РаспределенныеПартии.Колонки.Добавить("ВидПродукции");
	
	ПолеСортировкиПокупателя = Неопределено;
	ЗнакСортировкиПокупателя = Неопределено;
	
	Для Каждого СтрОтгрузки Из Список Цикл
		Если НЕ(СтрОтгрузки.Отметка) Тогда
			Продолжить;
		КонецЕсли;
				
		Если ЗначениеЗаполнено(СтрОтгрузки.ДокументИнвентаризации) Тогда
			кб99_ВСД.СообщитьИнфо("Для "+СтрОтгрузки.ДокументРеализации+" уже создан "+СтрОтгрузки.ДокументИнвентаризации+" ->Пропускаю");
				Продолжить;
		КонецЕсли;
		
		тз = кб99_ВСД_ЗаполнениеДокументов.ВыгрузитьТЧ(СтрОтгрузки.ДокументРеализации, ПараметрыОрганизации);
		Для Каждого стрТЗ Из ТЗ Цикл
	        СтрПартий = Времпартии.Добавить();
			СтрПартий.Номенклатура = стрТЗ.Номенклатура;
			СтрПартий.ВСД_Продукция_Элемент = стрТЗ.Продукция_Элемент;
			СтрПартий.КоличествоСписания = стрТЗ.Количество;
			СтрПартий.СерияНоменклатуры = стрТЗ.СерияНоменклатуры;
			СтрПартий.Документ = СтрОтгрузки.ДокументРеализации;
			СтрПартий.Контрагент = СтрОтгрузки.ДокументРеализации.Контрагент;
			СтрПартий.ТермУсловияПеревозки = стрТЗ.ТермУсловияПеревозки;
			СтрПартий.ВидПродукции = стрТЗ.ВидПродукции;
		КонецЦикла;
		
	КонецЦикла;
	
	ВремПартии.Свернуть("ВСД_Продукция_Элемент, СерияНоменклатуры, Номенклатура, Документ, ТермУсловияПеревозки, Контрагент, ВидПродукции", "КоличествоСписания");
	ВремПартии.Сортировать("ВСД_Продукция_Элемент");

	Если ВремПартии.Количество() = 0 Тогда
		кб99_ВСД.СообщитьИнфо("Нет документов к созданию ВСД ->");
		Возврат РаспределенныеПартии;
	КонецЕсли;
	
	СписокПродукцииЭлементов = кб99_ВСД_Утилиты.СвернутьМассив(ВремПартии.ВыгрузитьКолонку("ВСД_Продукция_Элемент"));
	СписокНоменклатуры = кб99_ВСД_Утилиты.СвернутьМассив(ВремПартии.ВыгрузитьКолонку("Номенклатура"));
	
	тзАктуальныхПартий = кб99_ВСД.ПолучитьАктуальныеПартии(ПараметрыОрганизации, 
		СписокПродукцииЭлементов, 
		ПараметрыОрганизации.Отправитель_Площадка, 
		ПараметрыОрганизации.Отправитель_ХозСубъект,
		ПолеСортировкиПокупателя,
		ЗнакСортировкиПокупателя,
		СписокНоменклатуры);
	
	Если НЕ (ТипЗнч(тзАктуальныхПартий) = Тип("ТаблицаЗначений")) Тогда
		кб99_ВСД.СообщитьИнфо("Нет актуальных партий для создания Документов ");
		Возврат РаспределенныеПартии;
	КонецЕсли;
	
	УменьшитьАктуальныеПартииНаРаспределенные(тзАктуальныхПартий);
	
	Для Каждого стрНужныеПартии Из ВремПартии Цикл
		
		СтрокиПартий = кб99_ВСД.ПодобратьПартииПоПродукцияЭлемент(ПараметрыОрганизации, 
				тзАктуальныхПартий, 
				стрНужныеПартии.ВСД_Продукция_Элемент, 
				стрНужныеПартии.КоличествоСписания, 
				стрНужныеПартии.СерияНоменклатуры, 
				стрНужныеПартии.Номенклатура, 
				стрНужныеПартии.Контрагент);
				
		Если СтрокиПартий.Количество() = 0  Тогда
			НоваяСтрока = РаспределенныеПартии.Добавить();
			НоваяСтрока.Документ = стрНужныеПартии.Документ;
			НоваяСтрока.ТермическиеУсловияПеревозки = стрНужныеПартии.ТермУсловияПеревозки;
			НоваяСтрока.Номенклатура= стрНужныеПартии.Номенклатура;
			НоваяСтрока.Продукция_Элемент = стрНужныеПартии.ВСД_Продукция_Элемент;
			НоваяСтрока.КоличествоСписания = стрНужныеПартии.КоличествоСписания;
			НоваяСтрока.Количество = 0;
			НоваяСтрока.Остаток = 0;
			НоваяСтрока.ВидПродукции = стрНужныеПартии.ВидПродукции;
			Попытка
				НоваяСтрока.ПолеСортировки 		= кб99_ВСД_Запросы.ДатаXML(стрНужныеПартии.СерияНоменклатуры);
			Исключение
			КонецПопытки;
			кб99_ВСД.СообщитьИнфо("Нет партий для ["+стрНужныеПартии.ВСД_Продукция_Элемент +"]");
		   	Продолжить;
		КонецЕсли;
		
		Для Каждого СтрПартии Из СтрокиПартий Цикл
			НоваяСтрока = РаспределенныеПартии.Добавить();
			НоваяСтрока.Номенклатура= стрНужныеПартии.Номенклатура; 
			НоваяСтрока.Документ=стрНужныеПартии.Документ;
			НоваяСтрока.Партия = СтрПартии.Партия;
			НоваяСтрока.Продукция_Элемент = СтрПартии.Партия.Продукция_Элемент; 
			НоваяСтрока.Количество = СтрПартии.Количество; 
			НоваяСтрока.КоличествоСписания = СтрПартии.Количество;
			НоваяСтрока.ПолеСортировки 		= СтрПартии.ПолеСортировки;
			НоваяСтрока.ТермическиеУсловияПеревозки = стрНужныеПартии.ТермУсловияПеревозки;
			НоваяСтрока.Остаток = НоваяСтрока.Партия.Количество;
			НоваяСтрока.ВидПродукции = стрНужныеПартии.ВидПродукции;
		КонецЦикла;
		
		Если (СтрокиПартий.Итог("Количество") < стрНужныеПартии.КоличествоСписания) Тогда 
			НоваяСтрока = РаспределенныеПартии.Добавить();
			НоваяСтрока.Номенклатура= стрНужныеПартии.Номенклатура;
			НоваяСтрока.Документ=стрНужныеПартии.Документ;
			НоваяСтрока.Продукция_Элемент = стрНужныеПартии.ВСД_Продукция_Элемент;
			НоваяСтрока.КоличествоСписания	=  стрНужныеПартии.КоличествоСписания - СтрокиПартий.Итог("Количество") ;
			НоваяСтрока.ТермическиеУсловияПеревозки = стрНужныеПартии.ТермУсловияПеревозки;
			НоваяСтрока.ВидПродукции = стрНужныеПартии.ВидПродукции;
			Попытка
				НоваяСтрока.ПолеСортировки = кб99_ВСД_Запросы.ДатаXML(стрНужныеПартии.СерияНоменклатуры);
			Исключение
			КонецПопытки;
			НоваяСтрока.Количество = 0;
			НоваяСтрока.Остаток = 0;
		КонецЕсли;
	КонецЦикла;
	
	Возврат РаспределенныеПартии;
		
КонецФункции

&НаСервере
Процедура УменьшитьАктуальныеПартииНаРаспределенные(тзАктуальныхПартий)

	тз = Список.Выгрузить();
	тз.Свернуть("ДокументИнвентаризации, СтатусЗапроса", "");
	
	Для Каждого Строкатз Из Тз Цикл
		
		Если НЕ ЗначениеЗаполнено(Строкатз.ДокументИнвентаризации) Тогда
		    Продолжить;
		КонецЕсли;
		
		Если Строкатз.СтатусЗапроса = Перечисления.кб99_СтатусЗапроса.COMPLETED Тогда
		    Продолжить;
		КонецЕсли;
		
		тзДокВСД = Строкатз.ДокументИнвентаризации.Продукция.Выгрузить();
		тзДокВСД.Свернуть("Партия", "Количество");
		
		Для Каждого СтрокаВСД Из тзДокВСД Цикл
		    Если НЕ ЗначениеЗаполнено(СтрокаВСД.Партия) Тогда
		        Продолжить;
			КонецЕсли;
			
			НайденнаяСтрока = ТзАктуальныхПартий.Найти(СтрокаВСД.Партия, "Партия");

			Если НайденнаяСтрока <> Неопределено Тогда
    			НайденнаяСтрока.Количество = НайденнаяСтрока.Количество - (СтрокаВСД.Партия.Количество - СтрокаВСД.Количество);
				Если НайденнаяСтрока.Количество < 0  Тогда
					кб99_ВСД.СообщитьИнфо("В заполненных ранее ВСД на отправку обнаружено ПРЕВЫШЕНИЕ количества имеющейся партии по "+НайденнаяСтрока.Продукция_Элемент+"; (№ записи : "+СокрЛП(НайденнаяСтрока.Партия.НомерЗаписи)+") ; документ "+Строкатз.ДокументИнвентаризации);
					НайденнаяСтрока.Количество = 0;    
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	
	НайденнаяСтрока = ТзАктуальныхПартий.Найти(0, "Количество");
	Пока НЕ(НайденнаяСтрока = Неопределено) Цикл
		ТзАктуальныхПартий.Удалить(НайденнаяСтрока);
		НайденнаяСтрока = ТзАктуальныхПартий.Найти(0,"Количество");
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

//#Область БСП

// Дополняет таблицу значений - приемник данными из таблицы значений - источника.
// Типы ТаблицаЗначений, ДеревоЗначений, ТабличнаяЧасть не доступны на клиенте.
//
// Параметры:
//  ТаблицаИсточник - ТаблицаЗначений,
//                    ДеревоЗначений,
//                    ТабличнаяЧасть,
//                    ДанныеФормыКоллекция - таблица, из которой будут браться строки для заполнения;
//  ТаблицаПриемник - ТаблицаЗначений,
//                    ДеревоЗначений,
//                    ТабличнаяЧасть,
//                    ДанныеФормыКоллекция - таблица, в которую будут добавлены строки из таблицы-источника.
//
//&НаСервереБезКонтекста
//Процедура ДополнитьТаблицу(ТаблицаИсточник, ТаблицаПриемник)
//	
//	Для Каждого СтрокаТаблицыИсточник Из ТаблицаИсточник Цикл
//		ЗаполнитьЗначенияСвойств(ТаблицаПриемник.Добавить(), СтрокаТаблицыИсточник);
//	КонецЦикла;
//	
//КонецПроцедуры

//#КонецОбласти
